# GridlinesOutOfBoundsWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..GridlinesOutOfBoundsWarn Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridlinesOutOfBoundsWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridlinesOutOfBoundsWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridlinesOutOfBoundsWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace